In [1]:
import pandas as pd
import numpy as np

In [2]:
diz = {'Nome':'Vladmir', 'Cognome':'Putin',
       'Occupazione':'no, semplice visita'}
print(diz)

{'Nome': 'Vladmir', 'Cognome': 'Putin', 'Occupazione': 'no, semplice visita'}

In [3]:
diz = { 'Nome':['Antonietta','Vladimiro','Gionni'], 
       'Età':[67,3,32] }

In [4]:
df = pd.DataFrame(diz)

In [5]:
df

   Età        Nome
0   67  Antonietta
1    3   Vladimiro
2   32      Gionni

In [6]:
df['Età']

0    67
1     3
2    32
Name: Età, dtype: int64

In [7]:
#aggiamo colonna
df['sesso']=['F','M','M']

In [8]:
df

   Età        Nome sesso
0   67  Antonietta     F
1    3   Vladimiro     M
2   32      Gionni     M

In [9]:
#accedere a elemento
df.iloc[0,1] = 'Antonia'

In [10]:
df['Nome'][0]

'Antonia'

In [11]:
df

   Età       Nome sesso
0   67    Antonia     F
1    3  Vladimiro     M
2   32     Gionni     M

In [12]:
eta2=np.array(df['Età'])+1
df['Età']=eta2

In [13]:
df

   Età       Nome sesso
0   68    Antonia     F
1    4  Vladimiro     M
2   33     Gionni     M

In [14]:
df.T

             0          1       2
Età         68          4      33
Nome   Antonia  Vladimiro  Gionni
sesso        F          M       M

In [15]:
ddf=df.T
ddf["3"]=[44,'Ada','F']
df=ddf.T

In [16]:
df

  Età       Nome sesso
0  68    Antonia     F
1   4  Vladimiro     M
2  33     Gionni     M
3  44        Ada     F

In [17]:
df.sum()

Età                            149
Nome     AntoniaVladimiroGionniAda
sesso                         FMMF
dtype: object

sum(df['Età'])

In [18]:
df.mean()

Età    37.25
dtype: float64

In [19]:
np.mean(df['Età'])

37.25

In [20]:
df.shape

(4, 3)

In [21]:
media = sum(df['Età']) / df.shape[0]
print(media)

37.25

In [22]:
df.to_excel("primofile.xls")